#include<stdio.h>
int main() {
	int a = 3;
	int b = a << 1;
	int c = a ^ b;
	//正数的三码合一，算术移位：正数的左移右移都加零，负数左移加0，右移加1；用补码移动
	//逻辑移位即为无符号移动，都加0，左移乘2的几次方
	//原码 10000001
	//反码 11111110
	//补码 11111111
	printf("%d %d\a", b, a);
	//00000011
	//00000110
	//^为按位异或，即相同为0，不同为1，|为或，&为与，~为按位取反 ，&为取地址操作符，
	//* 解引用操作符，间接访问操作符  三目操作符  a>3 ? 1 : -1;
	a = a ^ b;
	b = a ^ b;
	a = a ^ b;
	printf("%d %d\n", b, a);
	//求一个整数存储在内存中的二进制中1的个数
	int num = 0;
	int count = 0;
	scanf_s("%d", &num);

	int i = 0;
	/* 32位系统，至少循环32次 */
	for (i = 0; i < 32; i++) {
		if (((num >> i) & 1) == 1)  // 如果num右移i位的结果和1按位与，为真
			count++;
	}
	printf("%d\n", count);

	return 0;
}